yousfulServer/app/controllers/articles_controller.rb

	def create
		#render text: params[:article].inspect
		@article = Article.new(article_params)

		if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 03 Mar 2015 08:26:50 UTC +00:00], ["text", "hhh"], ["title", "My Title"], ["updated_at", Tue, 03 Mar 2015 08:26:50 UTC +00:00]]