yousfulServer/app/controllers/events_controller.rb

   def create
  	puts "Creating"
  	#puts events_params
  	#puts Rack::Utils.parse_nested_query(params)
  	#puts JSON.parse(params)
#    puts params
  	plain = JSON.parse(Base64.decode64(params[:event]))
    puts plain
  	@event = Event.new

    @event.name = plain["Title"]
  	@event.lat = plain["Latitude"]
  	@event.long = plain["Longitude"]
    @event.heat = 0
    @event.photo_urls = "[]"
    @event.locationName = plain["LocationName"]
    @event.startTime = plain["StartTimestamp"]
    @event.description = plain["Description"]
    @event.vibe = plain["Vibe"]
    @event.activity = plain["Activity"]
  	if @event.save
---
INSERT INTO "events" ("created_at", "lat", "long", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 22 Jun 2015 23:37:25 UTC +00:00], ["lat", 37.784622], ["long", -122.41309], ["updated_at", Mon, 22 Jun 2015 23:37:25 UTC +00:00]]

  def destroy
    puts "Deleting"
    params.require(:id)
    Event.find(params[:id]).destroy
    render Event.all
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "events".* FROM "events"

   def show
  	puts "Showing"
	@events = Event.all
---
SELECT "events".* FROM "events"

  def upphoto
    puts "UpPhoto"
    #puts params
    params.require(:id)
    puts params[:id]
    uploaded_io = params[:image]

    @photoPath = Rails.root.join('public', 'uploads', uploaded_io.original_filename)
    puts @photoPath

    @event = Event.find(params[:id])
    @jsonPhotos = JSON.parse( @event.photo_urls)
    @jsonPhotos.push(@photoPath)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "events" SET "photo_urls" = ?, "updated_at" = ? WHERE "events"."id" = 7  [["photo_urls", "[{\"path\":\"/Users/Adrian/Projects/YousfulServer/yousfulServer/public/uploads/image.jpg\"}]"], ["updated_at", Wed, 26 Aug 2015 19:13:06 UTC +00:00]]